package com.wbdmitry.moviesearch.model.entity

import com.google.android.gms.maps.model.LatLng

data class Cinema(
    val position: LatLng,
    val title: String,
    val snippet: String
)

val cinemaList = arrayOf(
    Cinema(
        LatLng(59.875812487178074, 30.380653572174477),
        "Мираж Синема",
        "ул. Белы Куна, 3, Санкт-Петербург, 192242"
    ),
    Cinema(
        LatLng(59.88959406325809, 30.37241382624592),
        "Люксор",
        "Бухарестская ул., 30/32, Санкт-Петербург, 192102"
    ),
    Cinema(
        LatLng(59.93503273345605, 30.25774402874018),
        "Формула Кино Нео",
        "Большой проспект Васильевского острова, 68, Санкт-Петербург, 199106"
    ),
    Cinema(
        LatLng(59.96288477312805, 30.239204599767685),
        "Ассоциация владельцев кинотеатров",
        "д.33, кор.2, лит.Б, пом.104, ул. Кораблестроителей, Санкт-Петербург, 199397"
    ),
    Cinema(
        LatLng(59.99002657039134, 30.212425425499877),
        "Формула Кино",
        "Приморский пр., 72 лит. А, Санкт-Петербург, 197374"
    ),
    Cinema(
        LatLng(60.00993929930184, 30.29756946676163),
        "Формула Кино Сити Молл",
        "Сити Молл, Коломяжский пр., 17 А, Санкт-Петербург, 197348"
    ),
    Cinema(
        LatLng(59.971132735350174, 30.31748218608897),
        "Киноафиша.инфо",
        "ул. Льва Толстого, 9, офис 502, Санкт-Петербург, 197022"
    ),
)
